reset.org
#+TITLE: CSS RESET

* 最简化的CSS Reset
  - 基本的reset
    #+BEGIN_SRC css
      * {
        padding: 0;
        margin:0;
      }
    #+END_SRC
  - 加入border
    #+BEGIN_SRC css
    * {
      padding: 0;
      margin:0;
      border: 0;
    }
    #+END_SRC
  - 加入outline
    #+BEGIN_SRC css
      * {
        padding: 0;
        margin:0;
        border:0;
        outline:0;
      }
    #+END_SRC

* 浓缩实用型CSS Reset
  出自Perishable Press
    #+BEGIN_SRC css
      * {
        vertical-align: baseline;
        font-weight: inherit;
        font-family: inherit;
        font-style: inherit;
        font-size: 100%;
        padding: 0;
        margin:0;
        border:0;
        outline:0;
      }
    #+END_SRC

* Poor Man's CSS Reset
  #+BEGIN_SRC css
    html,body {
      padding: 0;
      margin: 0;
    }
    html {
      font-size: 1em;
    }
    body {
      font-size: 100%;
    }
    a img, :link img, :visited img {
      border: 0px;
    }
    * {
      padding: 0;
      margin:0;
      border:0;
      outline:0;
    }
   #+END_SRC
   这个重设方法将html和body下元素的padding和margin都设为0，
   并分别为html标签和body标签下的所有元素设置了初始的字体大小，
   最重要的是把有链接的图片的默认边框去掉了。
* Siolon's Global Reset
  #+BEGIN_SRC css
    * {
      vertical-align: baseline;
      font-family: inherit;
      font-style: inherit;
      border: none;
      padding: 0;
      margin: 0;
    }
    body {
      padding: 5px;
    }
    h1, h2, h3, h4, h5, h6, p, pre, blockquote, form, ul, ol, dl {
      margin: 20px 0;
    }
    li, dd, blockquote {
      margin-left: 40px;
    }
    table {
      border-collapse: collapse;
      border-spacing: 0;
    }
  #+END_SRC
* Shaun Inman's Global Reset
  #+BEGIN_src css
    body, div, dl, dt, dd, ul, ol, li, h1, h2, h3, h4, h5, h6,
    pre, form, fieldset, input, p, blockquote,
    table, th, td, embed, object {
      padding: 0;
      margin: 0;
    }
    table {
      border-collapse: collapse;
      border-spacing: 0;
    }
    fieldset, img, abbr {
      border: 0;
    }
    address, caption, cite, code, dfn, em,
    h1, h2, h3, h4, h5, h6, strong, th, var {
      font-weight: normal;
      font-style: normal;
    }
    ul {
      list-style: none;
    }
    caption, th {
      text-align: left;
    }
    h1, h2, h3, h4, h5, h6 {
      font-size: 1.0em;
    }
    q:before, q:after {
      content: "";
    }
    a, ins {
      text-decoration: none;
    }
  #+END_SRC
* YUI CSS Reset:
  #+BEGIN_src css
    body,div,dl,dt,dd,ul,ol,li,h1,h2,h3,h4,h5,h6,pre,
    form,fieldset,input,textarea,p,blockquote,th,td {
       padding: 0;
       margin: 0;
    }
    table {
      border-collapse: collapse;
      border-spacing: 0;
    }
    fieldset,img {
      border: 0;
    }
    address,caption,cite,code,dfn,em,strong,th,var {
      font-weight: normal;
      font-style: normal;
    }
    ol,ul {
      list-style: none;
    }
    caption,th {
      text-align: left;
    }
    h1,h2,h3,h4,h5,h6 {
      font-weight: normal;
      font-size: 100%;
    }
    q:before,q:after {
       content:"";
    }
    abbr,acronym {
       border: 0;
    }
  #+END_src

* Summary
  reset需要处理的属性
  - margin和padding
    -  body in chrome has "margin:8px"
    -  ul ol有预设样式
  - border, outline
    -  :visited, :link 下的 img 会有预设的border
    -  :foucs的元素会有预设outline
  - text-decoration
    -  a:active有预设样式
  - font-style
    - em 有预设样式
  - list-style
    -  ul ol 有预设样式
  - border-collapse, border-spacing
    - table 有预设样式
  - vertical
    - 不同元素的vertical表现并不一致
  - font-family
    - 安全字体
  - font-weight
    - strong 有预设font-weight
    - h(1,2,3..)系列有预设font-weight
  - text-aglin
    - caption 和 th 有预设 text-align
