reset.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSS RESET</title>
<!-- 2016-06-21 Tue 11:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="wuyunge" />
</head>
<body>
<div id="content">
<h1 class="title">CSS RESET</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 最简化的CSS Reset</a></li>
<li><a href="#sec-2">2. 浓缩实用型CSS Reset</a></li>
<li><a href="#sec-3">3. Poor Man's CSS Reset</a></li>
<li><a href="#sec-4">4. Siolon's Global Reset</a></li>
<li><a href="#sec-5">5. Shaun Inman's Global Reset</a></li>
<li><a href="#sec-6">6. YUI CSS Reset:</a></li>
<li><a href="#sec-7">7. Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 最简化的CSS Reset</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>基本的reset
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>:0;
}
</pre>
</div>
</li>
<li>加入border
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>:0;
  <span style="color: #6c71c4;">border</span>: 0;
}
</pre>
</div>
</li>
<li>加入outline
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>:0;
  <span style="color: #6c71c4;">border</span>:0;
  <span style="color: #6c71c4;">outline</span>:0;
}
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 浓缩实用型CSS Reset</h2>
<div class="outline-text-2" id="text-2">
<p>
出自Perishable Press
</p>
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">vertical-align</span>: baseline;
  <span style="color: #6c71c4;">font-weight</span>: inherit;
  <span style="color: #6c71c4;">font-family</span>: inherit;
  <span style="color: #6c71c4;">font-style</span>: inherit;
  <span style="color: #6c71c4;">font-size</span>: 100%;
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>:0;
  <span style="color: #6c71c4;">border</span>:0;
  <span style="color: #6c71c4;">outline</span>:0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Poor Man's CSS Reset</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">html,body </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>: 0;
}
<span style="color: #b58900;">html </span>{
  <span style="color: #6c71c4;">font-size</span>: 1em;
}
<span style="color: #b58900;">body </span>{
  <span style="color: #6c71c4;">font-size</span>: 100%;
}
<span style="color: #b58900;">a img, :link img, :visited img </span>{
  <span style="color: #6c71c4;">border</span>: 0px;
}
<span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>:0;
  <span style="color: #6c71c4;">border</span>:0;
  <span style="color: #6c71c4;">outline</span>:0;
}
</pre>
</div>
<p>
这个重设方法将html和body下元素的padding和margin都设为0，
并分别为html标签和body标签下的所有元素设置了初始的字体大小，
最重要的是把有链接的图片的默认边框去掉了。
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Siolon's Global Reset</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">* </span>{
  <span style="color: #6c71c4;">vertical-align</span>: baseline;
  <span style="color: #6c71c4;">font-family</span>: inherit;
  <span style="color: #6c71c4;">font-style</span>: inherit;
  <span style="color: #6c71c4;">border</span>: none;
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>: 0;
}
<span style="color: #b58900;">body </span>{
  <span style="color: #6c71c4;">padding</span>: 5px;
}
<span style="color: #b58900;">h1, h2, h3, h4, h5, h6, p, pre, blockquote, form, ul, ol, dl </span>{
  <span style="color: #6c71c4;">margin</span>: 20px 0;
}
<span style="color: #b58900;">li, dd, blockquote </span>{
  <span style="color: #6c71c4;">margin-left</span>: 40px;
}
<span style="color: #b58900;">table </span>{
  <span style="color: #6c71c4;">border-collapse</span>: collapse;
  <span style="color: #6c71c4;">border-spacing</span>: 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Shaun Inman's Global Reset</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">body, div, dl, dt, dd, ul, ol, li, h1, h2, h3, h4, h5, h6,</span>
<span style="color: #b58900;">pre, form, fieldset, input, p, blockquote,</span>
<span style="color: #b58900;">table, th, td, embed, object </span>{
  <span style="color: #6c71c4;">padding</span>: 0;
  <span style="color: #6c71c4;">margin</span>: 0;
}
<span style="color: #b58900;">table </span>{
  <span style="color: #6c71c4;">border-collapse</span>: collapse;
  <span style="color: #6c71c4;">border-spacing</span>: 0;
}
<span style="color: #b58900;">fieldset, img, abbr </span>{
  <span style="color: #6c71c4;">border</span>: 0;
}
<span style="color: #b58900;">address, caption, cite, code, dfn, em,</span>
<span style="color: #b58900;">h1, h2, h3, h4, h5, h6, strong, th, var </span>{
  <span style="color: #6c71c4;">font-weight</span>: normal;
  <span style="color: #6c71c4;">font-style</span>: normal;
}
<span style="color: #b58900;">ul </span>{
  <span style="color: #6c71c4;">list-style</span>: none;
}
<span style="color: #b58900;">caption, th </span>{
  <span style="color: #6c71c4;">text-align</span>: left;
}
<span style="color: #b58900;">h1, h2, h3, h4, h5, h6 </span>{
  <span style="color: #6c71c4;">font-size</span>: 1.0em;
}
<span style="color: #6c71c4;">q</span>:before, q:after {
  <span style="color: #6c71c4;">content</span>: <span style="color: #2aa198;">""</span>;
}
<span style="color: #b58900;">a, ins </span>{
  <span style="color: #6c71c4;">text-decoration</span>: none;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> YUI CSS Reset:</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-css"><span style="color: #b58900;">body,div,dl,dt,dd,ul,ol,li,h1,h2,h3,h4,h5,h6,pre,</span>
<span style="color: #b58900;">form,fieldset,input,textarea,p,blockquote,th,td </span>{
   <span style="color: #6c71c4;">padding</span>: 0;
   <span style="color: #6c71c4;">margin</span>: 0;
}
<span style="color: #b58900;">table </span>{
  <span style="color: #6c71c4;">border-collapse</span>: collapse;
  <span style="color: #6c71c4;">border-spacing</span>: 0;
}
<span style="color: #b58900;">fieldset,img </span>{
  <span style="color: #6c71c4;">border</span>: 0;
}
<span style="color: #b58900;">address,caption,cite,code,dfn,em,strong,th,var </span>{
  <span style="color: #6c71c4;">font-weight</span>: normal;
  <span style="color: #6c71c4;">font-style</span>: normal;
}
<span style="color: #b58900;">ol,ul </span>{
  <span style="color: #6c71c4;">list-style</span>: none;
}
<span style="color: #b58900;">caption,th </span>{
  <span style="color: #6c71c4;">text-align</span>: left;
}
<span style="color: #b58900;">h1,h2,h3,h4,h5,h6 </span>{
  <span style="color: #6c71c4;">font-weight</span>: normal;
  <span style="color: #6c71c4;">font-size</span>: 100%;
}
<span style="color: #6c71c4;">q</span>:before,q:after {
   <span style="color: #6c71c4;">content</span>:<span style="color: #2aa198;">""</span>;
}
<span style="color: #b58900;">abbr,acronym </span>{
   <span style="color: #6c71c4;">border</span>: 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Summary</h2>
<div class="outline-text-2" id="text-7">
<p>
reset需要处理的属性
</p>
<ul class="org-ul">
<li>margin和padding
<ul class="org-ul">
<li>body in chrome has "margin:8px"
</li>
<li>ul ol有预设样式
</li>
</ul>
</li>
<li>border, outline
<ul class="org-ul">
<li>:visited, :link 下的 img 会有预设的border
</li>
<li>:foucs的元素会有预设outline
</li>
</ul>
</li>
<li>text-decoration
<ul class="org-ul">
<li>a:active有预设样式
</li>
</ul>
</li>
<li>font-style
<ul class="org-ul">
<li>em 有预设样式
</li>
</ul>
</li>
<li>list-style
<ul class="org-ul">
<li>ul ol 有预设样式
</li>
</ul>
</li>
<li>border-collapse, border-spacing
<ul class="org-ul">
<li>table 有预设样式
</li>
</ul>
</li>
<li>vertical
<ul class="org-ul">
<li>不同元素的vertical表现并不一致
</li>
</ul>
</li>
<li>font-family
<ul class="org-ul">
<li>安全字体
</li>
</ul>
</li>
<li>font-weight
<ul class="org-ul">
<li>strong 有预设font-weight
</li>
<li>h(1,2,3..)系列有预设font-weight
</li>
</ul>
</li>
<li>text-aglin
<ul class="org-ul">
<li>caption 和 th 有预设 text-align
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: wuyunge</p>
<p class="date">Created: 2016-06-21 Tue 11:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
